<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da16_datetime.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


* Python `datetime` 모듈
    * `datetime` 클래스: 날짜(date), 시간(time)과 관련된 정보들을 저장, 표현할 수 있는 기능(메서드)들을 가지고 있는 데이터 타입.
    * https://docs.python.org/3/library/datetime.html 참고

In [1]:
import datetime  # datetime 모듈을 import

In [2]:
datetime.datetime.now()  #> Colab 가상 머신의 현재 시간을 리턴함.
# datetime 모듈에 있는 datetime 클래스에 있는 now() 메서드 호출

datetime.datetime(2021, 8, 19, 0, 42, 42, 426655)

In [3]:
from datetime import datetime  # datetime 모듈에서 datetime 클래스를 import

In [4]:
datetime.now()
# datetime 클래스의 now() 메서드 호출

datetime.datetime(2021, 8, 19, 0, 42, 42, 455469)


* `datetime` 클래스의 메서드

In [5]:
# datetime.now(): 코드가 실행되는 컴퓨터 OS에서 설정된 시간대의 현재 시간을 리턴
curr_dt = datetime.now()

In [6]:
curr_dt  # expression을 출력

datetime.datetime(2021, 8, 19, 0, 42, 42, 471568)

In [7]:
print(curr_dt)  # statement

2021-08-19 00:42:42.471568


* UTC(Coordinates Universal Timezone): 그리니치 천문대 기준 시간
* KST(Korean Standard Timezone): 한국표준시. UTC+09:00

In [8]:
# datetime.datetime 클래스의 속성들: year, month, day, hour, minute, second
print(type(curr_dt))
print(curr_dt.year)
print(curr_dt.month)
print(curr_dt.day)
print(f'{curr_dt.hour}:{curr_dt.minute}:{curr_dt.second}')

<class 'datetime.datetime'>
2021
8
19
0:42:42

In [9]:
# datetime.datetime() 생성자 함수
yesterday = datetime(2021, 8, 17)
print(yesterday)

2021-08-17 00:00:00

In [10]:
tomorrow = datetime(2021, 8, 19, 17, 20)
print(tomorrow)

2021-08-19 17:20:00

In [11]:
tomorrow - yesterday  # datetime 타입의 변수들의 뺄셈 결과는 timedelta 클래스 타입

datetime.timedelta(days=2, seconds=62400)


* `datetime`(날짜/시간) 객체 <---> `str`(문자열) 객체
    * `datetime.strftime(포맷문자열)`: `datetime` 객체를 포맷문자열 형식으로 formatting된 문자열로 변환해서 리턴.
    * `datetime.strptime(문자열, 포맷문자열)`: 문자열(str)을 `datetime` 객체로 변환(parsing).

* 날짜 포맷 문자열
    * 연(year): `%Y`(4자리 연도), `%y`(2자리 연도)
    * 월(month): `%m`(2자리 숫자), `%B`(월 이름), `%b`(월 이름 약자)
    * 일(day): `%d`(2자리 숫자)
    * 시(hour): `%H`(24시간 형식. 0 ~ 23), `%I`(12시간 형식. 1 ~ 12)
    * 분(minute): `%M`(2자리 숫자. 00 ~ 59)
    * 초(second): `%S`(2자리 숫자. 00 ~ 59)

In [12]:
curr_dt = datetime.now()
print(curr_dt)

2021-08-19 00:42:42.581514

`datetime` 객체 ---> `str`

In [13]:
curr_dt.strftime('%Y/%m/%d')  #> argument로 전달된 포맷으로 formatting된 문자열을 리턴.

'2021/08/19'

In [14]:
curr_dt.strftime('%b-%d-%y')

'Aug-19-21'

In [15]:
curr_dt.strftime('%I:%M:%S %p')  # %p: AM/PM(오전/오후) 표시

'12:42:42 AM'

`str` ---> `datetime` 객체

In [16]:
# datetime.strptime(string, format): format 형식의 문자열 string을 datetime 객체로 변환(parsing) 리턴.
datetime.strptime('2021-08-18 18:04:30', '%Y-%m-%d %H:%M:%S')

datetime.datetime(2021, 8, 18, 18, 4, 30)

In [17]:
datetime.strptime('08-18-21', '%m-%d-%y')

datetime.datetime(2021, 8, 18, 0, 0)

In [18]:
datetime.strptime('18-08-21', '%y-%m-%d')  # 우리나라 방식(년-월-일)

datetime.datetime(2018, 8, 21, 0, 0)

In [19]:
datetime.strptime('18-08-21', '%d-%m-%y')  # 영국 방식(일-월-년)

datetime.datetime(2021, 8, 18, 0, 0)

* timestamp(UNIX time, POSIX time, epoch time, ...): 1970년 1월 1일 0시 0분 0초를 시작으로 해서 1초마다 1씩 증가하는 숫자.
* `datetime.timestamp` 메서드: `datetime` 객체 ---> `timestamp`(숫자)
* `datetime.fromtimestamp` 메서드: `timestamp`(숫자) ---> `datetime` 객체

In [20]:
curr_dt = datetime.now()
print(curr_dt)

2021-08-19 00:54:40.563941

In [21]:
ts = curr_dt.timestamp()
print(ts)
print(type(ts))

1629334480.563941
<class 'float'>

In [22]:
dt = datetime.fromtimestamp(1629334480)
print(dt)
print(type(dt))

2021-08-19 00:54:40
<class 'datetime.datetime'>

In [23]:
ratings_file = 'https://github.com/wesm/pydata-book/raw/2nd-edition/datasets/movielens/ratings.dat'

In [24]:
import pandas as pd

In [25]:
ratings = pd.read_csv(ratings_file, sep='::', engine='python',
                      names=['user_id', 'movie_id', 'rating', 'ts'],
                      nrows=10)  # 파일에서 10개 행만 읽음

In [26]:
ratings

   user_id  movie_id  rating         ts
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291
5        1      1197       3  978302268
6        1      1287       5  978302039
7        1      2804       5  978300719
8        1       594       4  978302268
9        1       919       4  978301368

In [34]:
dates = []  # ratings 데이터프레임의 ts 값(timestamp)을 datetime 객체로 변환한 값들을 저장하기 위한 리스트
for ts in ratings['ts']:  # ts 컬럼의 값들을 처음부터 끝까지 반복하면서
    dates.append(datetime.fromtimestamp(ts))  # 숫자를 datetime으로 변환 후 리스트에 추가

print(dates)
print(pd.Series(dates))

# dates에 저장된 값들을 파생변수로 데이터프레임에 추가
ratings['dt'] = pd.Series(dates)

[datetime.datetime(2000, 12, 31, 22, 12, 40), datetime.datetime(2000, 12, 31, 22, 35, 9), datetime.datetime(2000, 12, 31, 22, 32, 48), datetime.datetime(2000, 12, 31, 22, 4, 35), datetime.datetime(2001, 1, 6, 23, 38, 11), datetime.datetime(2000, 12, 31, 22, 37, 48), datetime.datetime(2000, 12, 31, 22, 33, 59), datetime.datetime(2000, 12, 31, 22, 11, 59), datetime.datetime(2000, 12, 31, 22, 37, 48), datetime.datetime(2000, 12, 31, 22, 22, 48)]
0   2000-12-31 22:12:40
1   2000-12-31 22:35:09
2   2000-12-31 22:32:48
3   2000-12-31 22:04:35
4   2001-01-06 23:38:11
5   2000-12-31 22:37:48
6   2000-12-31 22:33:59
7   2000-12-31 22:11:59
8   2000-12-31 22:37:48
9   2000-12-31 22:22:48
dtype: datetime64[ns]

In [32]:
ratings

   user_id  movie_id  rating         ts                  dt
0        1      1193       5  978300760 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11
5        1      1197       3  978302268 2000-12-31 22:37:48
6        1      1287       5  978302039 2000-12-31 22:33:59
7        1      2804       5  978300719 2000-12-31 22:11:59
8        1       594       4  978302268 2000-12-31 22:37:48
9        1       919       4  978301368 2000-12-31 22:22:48

In [35]:
# pd.to_datetime() 함수: 문자열 Series 또는 숫자 Series를 datetime Series로 변환
ratings['dt2'] = pd.to_datetime(ratings['ts'], unit='s')
#> unit: timestamp(숫자)가 저장하고 있는 시간의 단위
# s: 초(second), ms: milli-second, us: micro-second, ns: nano-second
ratings

   user_id  movie_id  rating         ts                  dt                 dt2
0        1      1193       5  978300760 2000-12-31 22:12:40 2000-12-31 22:12:40
1        1       661       3  978302109 2000-12-31 22:35:09 2000-12-31 22:35:09
2        1       914       3  978301968 2000-12-31 22:32:48 2000-12-31 22:32:48
3        1      3408       4  978300275 2000-12-31 22:04:35 2000-12-31 22:04:35
4        1      2355       5  978824291 2001-01-06 23:38:11 2001-01-06 23:38:11
5        1      1197       3  978302268 2000-12-31 22:37:48 2000-12-31 22:37:48
6        1      1287       5  978302039 2000-12-31 22:33:59 2000-12-31 22:33:59
7        1      2804       5  978300719 2000-12-31 22:11:59 2000-12-31 22:11:59
8        1       594       4  978302268 2000-12-31 22:37:48 2000-12-31 22:37:48
9        1       919       4  978301368 2000-12-31 22:22:48 2000-12-31 22:22:48

CSV 파일 날짜/시간 처리

In [36]:
file_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/spx.csv'

In [37]:
df = pd.read_csv(file_path)

In [38]:
df.head()

                  Date     SPX
0  1990-02-01 00:00:00  328.79
1  1990-02-02 00:00:00  330.92
2  1990-02-05 00:00:00  331.85
3  1990-02-06 00:00:00  329.66
4  1990-02-07 00:00:00  333.75

In [39]:
df.tail()

                     Date      SPX
5467  2011-10-10 00:00:00  1194.89
5468  2011-10-11 00:00:00  1195.54
5469  2011-10-12 00:00:00  1207.25
5470  2011-10-13 00:00:00  1203.66
5471  2011-10-14 00:00:00  1224.58

데이터프레임의 Date 컬럼의 데이터 타입?

In [40]:
df.info()  #> Date 컬럼의 데이터 타입은 object -> 문자열(str)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5472 non-null   object
 1   SPX     5472 non-null   float64
dtypes: float64(1), object(1)
memory usage: 85.6+ KB

In [41]:
# 연도별 주식 가격의 평균, 최소, 최대
df['year'] = df['Date'].str[:4].astype('int')

In [42]:
df

                     Date      SPX  year
0     1990-02-01 00:00:00   328.79  1990
1     1990-02-02 00:00:00   330.92  1990
2     1990-02-05 00:00:00   331.85  1990
3     1990-02-06 00:00:00   329.66  1990
4     1990-02-07 00:00:00   333.75  1990
...                   ...      ...   ...
5467  2011-10-10 00:00:00  1194.89  2011
5468  2011-10-11 00:00:00  1195.54  2011
5469  2011-10-12 00:00:00  1207.25  2011
5470  2011-10-13 00:00:00  1203.66  2011
5471  2011-10-14 00:00:00  1224.58  2011

[5472 rows x 3 columns]

In [43]:
df.groupby('year')['SPX'].agg(['mean', 'min', 'max'])

             mean      min      max
year
1990   334.123506   295.46   368.95
1991   376.186324   311.49   417.09
1992   415.747008   394.50   441.28
1993   451.614822   429.05   470.94
1994   460.416508   438.92   482.00
1995   541.719087   459.11   621.69
1996   670.494843   598.48   757.03
1997   873.427787   737.01   983.79
1998  1085.503254   927.69  1241.81
1999  1327.329563  1212.19  1469.25
2000  1427.221071  1264.74  1527.46
2001  1194.178992   965.80  1373.73
2002   993.934802   776.76  1172.51
2003   965.227540   800.73  1111.92
2004  1130.649444  1063.23  1213.55
2005  1207.229444  1137.50  1272.74
2006  1310.461633  1223.69  1427.09
2007  1477.184343  1374.12  1565.15
2008  1220.042055   752.44  1447.16
2009   948.046389   676.53  1127.78
2010  1139.965516  1022.58  1259.78
2011  1276.093015  1099.23  1363.61

Date 컬럼의 타입이 문자열인 경우, 주기별(연도별, 분기별, 월별, ...) 통계를 계산하기 위해서는 문자열을 parsing해서 파생변수를 추가하고 groupby 계산을 해야 함.
Date 컬럼의 타입이 datetime인 경우, 그런 계산들을 간단히 수행할 수 있음.

In [45]:
df['dt'] = pd.to_datetime(df['Date'])

In [46]:
df

                     Date      SPX  year         dt
0     1990-02-01 00:00:00   328.79  1990 1990-02-01
1     1990-02-02 00:00:00   330.92  1990 1990-02-02
2     1990-02-05 00:00:00   331.85  1990 1990-02-05
3     1990-02-06 00:00:00   329.66  1990 1990-02-06
4     1990-02-07 00:00:00   333.75  1990 1990-02-07
...                   ...      ...   ...        ...
5467  2011-10-10 00:00:00  1194.89  2011 2011-10-10
5468  2011-10-11 00:00:00  1195.54  2011 2011-10-11
5469  2011-10-12 00:00:00  1207.25  2011 2011-10-12
5470  2011-10-13 00:00:00  1203.66  2011 2011-10-13
5471  2011-10-14 00:00:00  1224.58  2011 2011-10-14

[5472 rows x 4 columns]

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5472 non-null   object
 1   SPX     5472 non-null   float64
 2   year    5472 non-null   int64
 3   dt      5472 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 171.1+ KB

In [48]:
# 새로 추가된 dt 컬럼을 index로 변환
df = df.set_index('dt')

In [49]:
df.head()

                           Date     SPX  year
dt
1990-02-01  1990-02-01 00:00:00  328.79  1990
1990-02-02  1990-02-02 00:00:00  330.92  1990
1990-02-05  1990-02-05 00:00:00  331.85  1990
1990-02-06  1990-02-06 00:00:00  329.66  1990
1990-02-07  1990-02-07 00:00:00  333.75  1990

In [52]:
# df에서 datetime 타입의 인덱스를 사용해서 연도별 SPX 컬럼의 평균, 최솟값, 최댓값을 계산
df.resample('Y')['SPX'].agg(['mean', 'min', 'max'])

                   mean      min      max
dt
1990-12-31   334.123506   295.46   368.95
1991-12-31   376.186324   311.49   417.09
1992-12-31   415.747008   394.50   441.28
1993-12-31   451.614822   429.05   470.94
1994-12-31   460.416508   438.92   482.00
1995-12-31   541.719087   459.11   621.69
1996-12-31   670.494843   598.48   757.03
1997-12-31   873.427787   737.01   983.79
1998-12-31  1085.503254   927.69  1241.81
1999-12-31  1327.329563  1212.19  1469.25
2000-12-31  1427.221071  1264.74  1527.46
2001-12-31  1194.178992   965.80  1373.73
2002-12-31   993.934802   776.76  1172.51
2003-12-31   965.227540   800.73  1111.92
2004-12-31  1130.649444  1063.23  1213.55
2005-12-31  1207.229444  1137.50  1272.74
2006-12-31  1310.461633  1223.69  1427.09
2007-12-31  1477.184343  1374.12  1565.15
2008-12-31  1220.042055   752.44  1447.16
2009-12-31   948.046389   676.53  1127.78
2010-12-31  1139.965516  1022.58  1259.78
2011-12-31  1276.093015  1099.23  1363.61

In [53]:
# 분기(Quarter)별 통계
df.resample('Q')['SPX'].agg(['mean', 'min', 'max'])

                   mean      min      max
dt
1990-03-31   334.751951   324.15   343.53
1990-06-30   349.796508   329.11   367.40
1990-09-30   335.881746   300.97   368.95
1990-12-31   316.562031   295.46   331.75
1991-03-31   352.282951   311.49   376.72
...                 ...      ...      ...
2010-12-31  1204.585625  1137.03  1259.78
2011-03-31  1302.529032  1256.88  1343.01
2011-06-30  1318.332857  1265.42  1363.61
2011-09-30  1225.268437  1119.46  1353.22
2011-12-31  1171.356000  1099.23  1224.58

[88 rows x 3 columns]

In [54]:
# 월(Month)별 통계
df.resample('M')['SPX'].agg(['mean', 'min', 'max'])

                   mean      min      max
dt
1990-02-28   330.452632   324.15   334.89
1990-03-31   338.465000   332.74   343.53
1990-04-30   338.178000   329.11   344.74
1990-05-31   350.250000   332.25   361.23
1990-06-30   360.386667   352.06   367.40
...                 ...      ...      ...
2011-06-30  1287.288636  1265.42  1320.64
2011-07-31  1325.184500  1292.28  1353.22
2011-08-31  1185.305652  1119.46  1286.94
2011-09-30  1173.879048  1129.56  1216.01
2011-10-31  1171.356000  1099.23  1224.58

[261 rows x 3 columns]

In [55]:
# CSV 파일을 읽을 때, 날짜/시간 포맷의 문자열을 datetime 객체로 자동 변환
df2 = pd.read_csv(file_path, parse_dates=['Date'])
#> parse_dates: datetime 객체로 변환할 컬럼 이름들의 리스트.
#> parse_dates의 기본값은 False - 문자열을 datetime으로 자동 변환하지 않음.

In [56]:
df2.head()

        Date     SPX
0 1990-02-01  328.79
1 1990-02-02  330.92
2 1990-02-05  331.85
3 1990-02-06  329.66
4 1990-02-07  333.75

In [57]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5472 non-null   datetime64[ns]
 1   SPX     5472 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 85.6 KB

In [58]:
# datetime 객체를 저장하는 컬럼을 (row) index로 설정 -> resample 메서드를 사용하기 위해서
df2 = df2.set_index('Date')
df2.head()

               SPX
Date
1990-02-01  328.79
1990-02-02  330.92
1990-02-05  331.85
1990-02-06  329.66
1990-02-07  333.75